georgik/OpenTyrian/sdkconfig.defaults.esp32_p4_function_ev_board
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1 Project Minimal Configuration
#

# Board selection
CONFIG_SDL_BSP_ESP32_P4_FUNCTION_EV=y

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BSP_LCD_RGB_BUFFER_NUMS=2
CONFIG_BSP_LCD_RGB_BOUNCE_BUFFER_MODE=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# BSP specific
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_TYPE_1024_600=y
# CONFIG_BSP_LCD_TYPE_1280_800 is not set

# SD Card configuration for ESP32-P4 Function EV Board
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"

# Required for TTF rendering if it happens in main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32000

# USB Host Hub support for connecting multiple devices (mouse + keyboard through hub)
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# ESP32-P4-Ev-Board - v1.4 - with newer P4 this could be removed
#CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
#CONFIG_ESP32P4_REV_MIN_100=y


